ChartsOfAccounts/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ChartOfAccounts>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарныйСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Временный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

ChartsOfAccounts/Хозрасчетный/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//  Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//           где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы,
//           связанного с реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("Код");
	БлокируемыеРеквизиты.Добавить("Родитель");
	БлокируемыеРеквизиты.Добавить("ПарныйСчет");
	БлокируемыеРеквизиты.Добавить("Наименование");
	БлокируемыеРеквизиты.Добавить("Вид");
	БлокируемыеРеквизиты.Добавить("Временный");
	БлокируемыеРеквизиты.Добавить("Забалансовый");
	БлокируемыеРеквизиты.Добавить("ЗапретитьИспользоватьВПроводках");
	БлокируемыеРеквизиты.Добавить("Валютный");
	БлокируемыеРеквизиты.Добавить("Количественный");
	БлокируемыеРеквизиты.Добавить("ВидыСубконто");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	// если счет является родителем- то этот счет группа
	// у группы не может быть субконто		
	
	// получение всех родителей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Хозрасчетный.Родитель КАК Ссылка,
		|	Хозрасчетный.Родитель.Код КАК РодительКод
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	НЕ Хозрасчетный.Родитель.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	РодительКод";
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПланСчетовОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();	
		ПланСчетовОбъект.ЗапретитьИспользоватьВПроводках = Истина;
		
		Попытка
			ПланСчетовОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	// Заполнение парных счетов
	МассивЭлементов = Новый Массив; 	
	КлассификаторXML = ПланыСчетов.Хозрасчетный.ПолучитьМакет("СписокПарныхСчетов").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные; 
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		КодСчет = СокрЛП(СтрокаТаблицыЗначений.КодСчетаУчета);
		КодПарныйСчет = СокрЛП(СтрокаТаблицыЗначений.КодПарногоСчетаУчета);
		
		// Получение ссылок
		СчетУчета = ПланыСчетов.Хозрасчетный.НайтиПоКоду(КодСчет);
		СчетУчетаПарный = ПланыСчетов.Хозрасчетный.НайтиПоКоду(КодПарныйСчет);
		Если СчетУчета.Пустая() ИЛИ СчетУчетаПарный.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		// Получение объектов
		СчетУчетаОбъект = СчетУчета.ПолучитьОбъект();
		СчетУчетаОбъект.ПарныйСчет = СчетУчетаПарный;
		СчетУчетаОбъектПарный = СчетУчетаПарный.ПолучитьОбъект();
		СчетУчетаОбъектПарный.ПарныйСчет = СчетУчета;
		
		// Попытка
		Попытка
			СчетУчетаОбъект.Записать();
			СчетУчетаОбъектПарный.Записать();
		Исключение
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось завершить запись по причине: %1'"), 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		КонецПопытки;
	КонецЦикла;	

КонецПроцедуры // ЗаполнитьПоУмолчанию()	

Функция ПолучитьСчетаИсключения() Экспорт
	
	МассивСчетовИсключений = Новый Массив;
	
	
	Возврат Новый ФиксированныйМассив(МассивСчетовИсключений);
	
КонецФункции

#КонецОбласти

#Область ИнтерфейсПечати

Функция ПечатьПланаСчетов(ВыводитьОписания = Ложь)
	
	Макет = ПланыСчетов.Хозрасчетный.ПолучитьМакет("Описание");
	
	Шапка  = Макет.ПолучитьОбласть("Шапка");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывести(Шапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаПланаСчетов.Ссылка КАК Ссылка,
		|	ТаблицаПланаСчетов.ЭтоГруппа КАК ЭтоГруппа,
		|	ТаблицаПланаСчетов.Ссылка.Код КАК Код,
		|	ТаблицаПланаСчетов.Ссылка.Наименование КАК Наименование,
		|	ТаблицаПланаСчетов.Ссылка.Валютный КАК Валютный,
		|	ТаблицаПланаСчетов.Ссылка.Количественный КАК Количественный,
		|	ТаблицаПланаСчетов.Ссылка.Забалансовый КАК Забалансовый,
		|	ТаблицаПланаСчетов.Ссылка.Вид КАК Вид,
		|	ТаблицаПланаСчетов.Ссылка.ВидыСубконто.(
		|		НомерСтроки КАК НомерСтроки,
		|		ВидСубконто.Наименование КАК Наименование,
		|		ТолькоОбороты КАК ТолькоОбороты
		|	) КАК ВидыСубконто
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПланСчетов1.Ссылка КАК Ссылка,
		|		ВЫБОР
		|			КОГДА КОЛИЧЕСТВО(ПланСчетов2.Ссылка) > 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ КАК ЭтоГруппа
		|	ИЗ
		|		ПланСчетов.Хозрасчетный КАК ПланСчетов1
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК ПланСчетов2
		|			ПО ПланСчетов1.Ссылка = ПланСчетов2.Родитель
		|	ГДЕ
		|		ПланСчетов1.ПометкаУдаления = ЛОЖЬ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПланСчетов1.Ссылка) КАК ТаблицаПланаСчетов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаПланаСчетов.Ссылка.Порядок";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			Строка = Макет.ПолучитьОбласть("Группа");
		Иначе
			Строка = Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
		
		Строка.Параметры.Заполнить(Выборка);
		
		Если Выборка.Вид = ВидСчета.Активный Тогда
			Строка.Параметры.Активность = "А";
		ИначеЕсли Выборка.Вид = ВидСчета.Пассивный Тогда
			Строка.Параметры.Активность = "П";
		Иначе
			Строка.Параметры.Активность = "АП";
		КонецЕсли;
		
		ВидыСубконто = Выборка.ВидыСубконто.Выбрать();
		Пока ВидыСубконто.Следующий() Цикл
			Строка.Параметры["Субконто" + ВидыСубконто.НомерСтроки] = ?(ВидыСубконто.ТолькоОбороты, "(об) ", "") + ВидыСубконто.Наименование;
		КонецЦикла;
		
		ТабДокумент.Вывести(Строка);
		
		Если ВыводитьОписания Тогда
			
			Попытка
				Описание = Макет.ПолучитьОбласть(ПланыСчетов[Выборка.Ссылка.Метаданные().Имя].ПолучитьИмяПредопределенного(Выборка.Ссылка));
				ТабДокумент.Вывести(Описание);
			Исключение
				// Запись в журнал регистрации не требуется
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабДокумент.ФиксацияСверху = 2;
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Ложь;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПростойСписок") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПростойСписок", "Простой список", ПечатьПланаСчетов());                                            
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СПодробнымиОписаниями") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СПодробнымиОписаниями", "С подробными описаниями", ПечатьПланаСчетов(Истина));                                            
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// При вводе кода счета с цифровой клавиатуры заменяем запятую на точку
	Если ТипЗнч(Параметры.СтрокаПоиска) = Тип("Строка") Тогда
		Параметры.СтрокаПоиска = СтрЗаменить(Параметры.СтрокаПоиска, ",", ".");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
